docs: use mermaid instead of plantuml
Closes #17
